{
  "mainContent": {
    "intro": {
      "name": "Nikolay Trakiyski",
      "tagline": "AI Solutions Architect | Product Manager | Low-code & Open-source addict",
      "contactBadges": [
        { "icon": "FaEnvelope", "text": "nikolay.trakiyski@gmail.com", "href": "mailto:nikolay.trakiyski@gmail.com", "type": "email" },
        { "icon": "FaPhone", "text": "+359893401356", "href": "tel:+359893401356", "type": "phone" },
        { "icon": "FaLinkedin", "text": "nikolaytrakiyski", "href": "https://www.linkedin.com/in/nikolaytrakiyski", "type": "linkedin" },
        { "icon": "FaMapMarkerAlt", "text": "Sofia, Bulgaria", "type": "location" }
      ]
    },
    "bio": {
      "title": "BIO",
      "paragraph": "I'm obsessed with solving problems by building things - not just managing them. I get energized when someone shows me a manual process that takes 3 hours and I can automate it in 30 minutes using AI and low-code tools, or when I can turn a struggling product around because I understand both what users actually need and how to build it technically. I'm the person who can speak fluent CEO, translate it into developer language, and then build the solution myself - which means faster decisions, shorter feedback loops, and products that actually solve the right problems."
    },
    "experience": {
      "title": "Professional Experience",
      "jobs": [
        {
          "title": "AI Solutions Architect",
          "company": "Fast Track",
          "dates": "Dec 2024 - Jun 2025",
          "challenge": "CEO with big social media influencer energy talking about revolutionary AI impact while two fresh college graduates stared at me waiting for step-by-step instructions on how to build 'the future.'",
          "points": [
            "Turned college graduates into independent developers in 3 months by refusing to give them simple answers and instead teaching them how to think through problems - they went from asking 'what should I do?' to presenting me with solution options and their reasoning",
            "Built a multi-tenant Next.js application with AI integration that connected 4 different databases, RAG systems, and N8N workflows while the CEO was still explaining his vision in abstract terms",
            "Created automated workflows that eliminated 80% of manual data processing by mapping out every step of existing processes and identifying exactly where humans were doing repetitive tasks that APIs could handle",
            "Designed scalable infrastructure that could handle the CEO's '10,000 users' vision while actually working with our current 50 beta users - built for scale without over-engineering"
          ],
          "summarizedPoints": [
            "Turned college graduates into independent developers in 3 months by teaching them how to think through problems, leading to solution proposals.",
            "Built a multi-tenant Next.js app with AI integration, connecting 4 databases, RAG systems, and N8N workflows.",
            "Automated workflows, eliminating 80% of manual data processing by identifying repetitive tasks suitable for API handling.",
            "Designed scalable infrastructure for 10,000 users, balancing future growth with current needs of 50 beta users."
          ],
          "skills": {
            "list": [
              "Full-Stack Development & Web Architecture",
              "DevOps & Scalable Infrastructure",
              "Strategic Product Leadership & Requirements Gathering",
              "Database Management & AI Integration"
            ]
          },
          "tools": {
            "list": [
              "AI & Automation Platforms (OpenAI, OpenRouter, Mistral OCR, N8N)",
              "Modern Web Stack (Next.js, Shadcn, Clerk, Resend)",
              "Cloud Infrastructure & DevOps (Hetzner, Coolify, GitHub, Cloudflare)",
              "Database & Data Management (Supabase, MongoDB)"
            ]
          },
          "projects": {
            "list": [
              "Multi-tenant Next.js SaaS web application with N8N business logic",
              "Multiple apps workflow automations",
              "Custom Vector Store development",
              "RAG (Retrieval-Augmented Generation) implementations"
            ]
          }
        },
        {
          "title": "Innovation Manager",
          "company": "PM Mentality (Non-Profit)",
          "dates": "Oct 2023 - Present",
          "challenge": "Building a scalable project management mentorship program from the ground up, managing each season's unique requirements while building the technology infrastructure and serving as both mentor and technical lead.",
          "points": [
            "Built complete program infrastructure for 3 seasons including custom registration forms, internal management tools, and participant tracking systems using low-code platforms.",
            "Designed and developed pmmentality.com website that serves as marketing platform, registration portal, and resource hub for mentors and mentees, handling the entire participant journey from discovery to program completion",
            "Mentored 2 entry-level participants through PMBOK in Season 1 by translating theoretical project management concepts into practical, real-world examples they could immediately apply in their careers",
            "Participated in workshops that teach product management and software development fundamentals to other members, enabling them to understand the complete product lifecycle and contribute more effectively to program development"
          ],
          "summarizedPoints": [
            "Built complete program infrastructure for 3 seasons using low-code platforms, including registration, management, and tracking systems.",
            "Designed and developed pmmentality.com, serving as a marketing platform, registration portal, and resource hub for mentors/mentees.",
            "Mentored 2 entry-level participants through PMBOK, translating theoretical concepts into practical, real-world applications.",
            "Taught product management and software development fundamentals in workshops, improving team contribution to program development."
          ],
          "skills": {
            "list": [
              "Leadership & Mentorship",
              "Full-Stack Development & Product Management",
              "Scrum & Agile Methodologies",
              "Program Infrastructure Design"
            ]
          },
          "tools": {
            "list": [
              "Low-code & Automation Platforms (Coda, n8n, Retool)",
              "Web Development & AI (Next.js, OpenRouter, WebFlow)",
              "Document & Collaboration (Docmost, G-Suite)",
              "Project & Program Management (Trello)"
            ]
          },
          "projects": {
            "list": [
              "Development of the main PM Mentality website",
              "Building digital products for program operation & management",
              "Mentoring 2 mentees covering PMBOK7 principles",
              "Scalable program infrastructure development"
            ]
          }
        },
        {
          "title": "Product Owner",
          "company": "Denshi",
          "dates": "Oct 2024 - Dec 2024",
          "challenge": "Short-term engagement to help clients who knew they had business problems but couldn't articulate what they actually needed built, while coordinating between C-level executives, software architects, and development teams.",
          "points": [
            "Transformed vague business problems into concrete technical requirements by conducting deep-dive discovery sessions with clients, uncovering the real issues behind their initial requests and translating them into actionable development plans",
            "Collaborated with software architect to design scalable solutions that met immediate client needs while building for future growth - balanced performance requirements with budget constraints across multiple client projects",
            "Managed complex stakeholder communication across C-level executives, clients, and development teams, ensuring everyone stayed aligned on priorities and progress while adapting to changing requirements",
            "Delivered software solutions on tight timelines by maintaining constant communication loops and proactive project updates, resulting in client satisfaction and repeat engagement requests"
          ],
          "summarizedPoints": [
            "Transformed vague business problems into concrete technical requirements through deep-dive discovery sessions with clients.",
            "Collaborated with software architects to design scalable solutions, balancing client needs, performance, and budget constraints.",
            "Managed complex stakeholder communication, ensuring alignment and adapting to changing requirements across teams.",
            "Delivered software solutions on tight timelines through constant communication and proactive updates, ensuring client satisfaction."
          ],
          "skills": {
            "list": [
              "Project Management",
              "Client Communication & Stakeholder Management",
              "UI/UX Design & Wireframing",
              "Internal Operations Automation"
            ]
          },
          "tools": {
            "list": [
              "Cloud & Development Platforms (Azure, Next.js)",
              "Productivity & Collaboration (Microsoft Suite)",
              "Design & Prototyping (Figma, Relume)",
              "Internal Tools & Automation (Retool)"
            ]
          },
          "projects": {
            "list": [
              "Created an internal system for updating and tracking project progress, including regular client updates.",
              "Led a website development project, focusing on wireframing, client communication, and requirements gathering."
            ]
          }
        },
        {
          "title": "Product Manager",
          "company": "Akkodis",
          "dates": "Apr 2022 - Jun 2023",
          "challenge": "Got promoted to lead team growth and client relations after proving I could turn around struggling projects. Now needed to scale the team, mentor others, and handle direct client communication across multiple international markets.",
          "points": [
            "Grew and optimized team from 4 to 6 people by identifying skill gaps and adding the right people - brought in a dedicated designer and a junior product owner for me to mentor.",
            "Started managing direct client relationships across Germany, Australia, USA, and France, learning to navigate different business cultures and communication styles while maintaining consistent product vision",
            "Mentored junior product owner from zero to independent - they went from needing approval for every decision to running their own stakeholder calls within 4 months because I gave them real responsibility, not just tasks",
            "Solved the 'everyone needs something different' problem by finding the common pain points across all international teams and building flexible features that adapted to local needs instead of separate features for each region"
          ],
          "summarizedPoints": [
            "Grew and optimized team from 4 to 6 by identifying skill gaps and adding a designer and junior product owner for mentorship.",
            "Managed direct client relationships across Germany, Australia, USA, and and France, adapting to diverse business cultures.",
            "Mentored a junior product owner to independence within 4 months by delegating real responsibility and fostering ownership.",
            "Solved the 'everyone needs something different' problem by building flexible features addressing common international pain points."
          ],
          "skills": {
            "list": [
              "User Research & Interviews",
              "C-level Requirements Gathering",
              "Leadership & Team Navigation",
              "Product Ownership & Strategy"
            ]
          },
          "tools": {
            "list": [
              "User Research & Analytics (Dovetails)",
              "Cloud & Development Platforms (AWS, Vue.js)",
              "Productivity & Collaboration (Microsoft Suite)",
              "Low-code & Automation (Airtable, n8n)"
            ]
          },
          "projects": {
            "list": [
              "Developed a globally adopted tool for multi-industry team collaboration.",
              "Orchestrated strategic growth and performance of a 6-person product team.",
              "Built and deployed internal no-code tools for process automation.",
              "Managed product strategy and deployment for diverse international markets."
            ]
          }
        },
        {
          "title": "Product Owner",
          "company": "Akkodis",
          "dates": "Jul 2021 - Apr 2022",
          "challenge": "Inherited a project that had been running for 2 years with minimal impact, serving 30,000 employees. Previous team couldn't deliver results, and I was wearing multiple hats as designer, product manager, and stakeholder communicator.",
          "points": [
            "Delivered 150% increase in monthly active users within 2 months by spending the first week actually understanding what users needed instead of what stakeholders said they needed - turned out they were completely different things",
            "Established direct communication with VP of Product and learned to translate between executive vision and development reality - they spoke in business outcomes, developers spoke in technical requirements, I became the translator",
            "Built internal application that scaled across 30,000 employees by designing for the edge cases first (the unusual users in different departments) which made the common cases work perfectly",
            "Proved I could handle multiple roles simultaneously while delivering better results than the previous specialized team - this led to my promotion to Senior Product Manager"
          ],
          "summarizedPoints": [
            "Increased monthly active users by 150% in 2 months by focusing on actual user needs over stakeholder assumptions.",
            "Translated executive vision into technical requirements, bridging communication gaps between VP of Product and developers.",
            "Built a scalable internal application for 30,000 employees by prioritizing edge cases, ensuring broad functionality.",
            "Demonstrated ability to handle multiple roles, delivering superior results and earning a promotion to Senior Product Manager."
          ],
          "skills": {
            "list": [
              "Scrum & Agile Methodologies",
              "Product Management & Strategy",
              "Design Systems & UI/UX",
              "Talent Acquisition & Recruitment"
            ]
          },
          "tools": {
            "list": [
              "Design & Prototyping (Figma, Whimsical)",
              "Productivity & Collaboration (Microsoft Suite)",
              "AI & Ideation (OpenAI)",
              "Project Management"
            ]
          },
          "projects": {
            "list": [
              "Successfully transferred and turned around a 2-year stagnant project from an international team.",
              "Recruited 3 developers and 1 QA, significantly expanding team capabilities.",
              "Led the redesign of a key web application.",
              "Implemented changes resulting in increased user engagement."
            ]
          }
        },
        {
          "title": "Product Owner",
          "company": "Yettel",
          "dates": "Apr 2020 - Jun 2021",
          "challenge": "Junior role where I had to prove I could handle real product decisions, plus we needed to turn an internal tool into something we could actually sell to other companies.",
          "points": [
            "Transformed internal employee application into market-ready SaaS product by interviewing potential clients from 3 different industries and discovering they all had the same core problem but described it differently",
            "Conducted sales meetings with potential clients where I had to demonstrate the product, understand their specific needs, and promise features we hadn't built yet - learned to sell vision while delivering reality",
            "Managed team of 5 people including sales and developers by creating a process where we could build one feature that worked for multiple client types instead of custom solutions for everyone",
            "Secured first 3 paying clients by building exactly what they needed, not what we thought they needed - spent more time in their offices understanding their workflow than in ours building features"
          ],
          "summarizedPoints": [
            "Transformed internal app into market-ready SaaS by identifying common client problems across industries.",
            "Conducted sales meetings, demonstrating product vision and understanding specific client needs.",
            "Managed a 5-person team, streamlining feature development for multiple client types.",
            "Secured first 3 paying clients by delivering precise solutions based on deep workflow understanding."
          ],
          "skills": {
            "list": [
              "Market Analysis and Product-Market Fit.",
              "SaaS Product Development.",
              "Client Relationship Management.",
              "Sales and Negotiation Skills."
            ]
          },
          "tools": {
            "list": [
              "CRM software for client management.",
              "Project management tools (e.g., Asana, Trello).",
              "Communication platforms (e.g., Slack, Microsoft Teams).",
              "Analytics tools for market research."
            ]
          },
          "projects": {
            "list": [
              "Transformed internal tool into a market-ready SaaS product.",
              "Secured initial paying clients through product demonstrations.",
              "Managed the development of client-specific features.",
              "Contributed to the product roadmap for SaaS expansion."
            ]
          }
        },
        {
          "title": "Junior Product Owner",
          "company": "Yettel",
          "dates": "Nov 2019 - Apr 2020",
          "challenge": "First real job, had a mentor watching everything I did, needed to prove I could handle stakeholder communication and team management without screwing up.",
          "points": [
            "Learned to communicate with stakeholders by asking questions that revealed the real problem behind their requests - discovered most initial requirements were solutions disguised as problems",
            "Managed small development team while learning project management - made every mistake possible but documented them so I wouldn't repeat them",
            "Delivered working software on schedule by over-communicating with everyone involved and building buffer time into estimates because I knew I was still learning",
            "Graduated from needing approval to making independent decisions by the end of 6 months - mentor went from reviewing every decision to just having weekly check-ins"
          ],
          "summarizedPoints": [
            "Learned stakeholder communication by asking questions to reveal true problems behind requests, not just stated solutions.",
            "Managed a small dev team, learning project management and documenting mistakes for future improvement.",
            "Delivered software on schedule by over-communicating and building buffer time into estimates due to learning curve.",
            "Progressed from needing approval to making independent decisions within 6 months, with reduced mentor oversight."
          ],
          "skills": {
            "list": [
              "Stakeholder Communication.",
              "Project Management Fundamentals.",
              "Team Collaboration.",
              "Problem-solving and Adaptability."
            ]
          },
          "tools": {
            "list": [
              "Jira for task management.",
              "Confluence for meeting notes and documentation.",
              "Microsoft Excel for data tracking.",
              "Google Meet for team communication."
            ]
          },
          "projects": {
            "list": [
              "Assisted in the launch of a new internal communication tool.",
              "Contributed to the development of a team-wide project tracking system.",
              "Supported the implementation of new agile ceremonies.",
              "Participated in user acceptance testing for product releases."
            ]
          }
        }
      ]
    },
    "skills": {
      "title": "Core Skills",
      "list": [
        {
          "title": "1. Business-to-Technical Translation",
          "description": "Most people can either understand business requirements OR technical implementation. I spent 5 years deliberately learning both because I kept seeing projects fail at the translation layer. I can sit in a meeting where the CEO talks about 'revolutionizing customer experience' and walk out with a technical specification that developers can actually build. Proof: I've inherited 3 different 'stuck' projects and delivered results within 2 months each time by fixing the communication gap, not the technical problems."
        },
        {
          "title": "2. AI Integration and Process Automation",
          "description": "While others debate whether AI will replace jobs, I'm already building systems that make humans 10x more effective at their jobs. I map out manual processes, identify the repetitive parts, and build automated workflows using N8N, APIs, and AI that handle the boring stuff so humans can focus on creative problem-solving. Real example: I built an automated system that eliminated 80% of manual data entry across Gmail, Salesforce, and Instagram by understanding exactly what data moves where and why."
        },
        {
          "title": "3. Full-Stack Product Development",
          "description": "I don't just manage product development - I can build the entire product myself when needed. This isn't about showing off technical skills; it's about credibility. When I tell developers something will take 2 weeks, they believe me because I've built similar features. When I promise clients a feature, I know exactly what's involved. I can prototype solutions in days instead of months, which means faster validation and iteration cycles."
        }
      ]
    },
    "whyMe": {
      "title": "What Makes Me Different",
      "paragraphs": [
        "I test 2-3 new applications every day - not as a hobby, but as research. I approach each one with two minds: the curious user trying to understand the experience, and the developer reverse-engineering how it was built. This constant learning keeps me ahead of trends and gives me a massive toolkit of solutions I can adapt to new problems.",
        "I refuse to be \"just\" a product manager or \"just\" a developer because the biggest value I bring is connecting different worlds. Companies hire specialists and then struggle to get them to work together effectively. I am the bridge - I can code the solution, manage the team building it, and explain to executives why it matters."
      ]
    },
    "contactInfo": {
      "title": "Contact Information",
      "introParagraph": "Ready to discuss how I can help your team move faster and build better products. Let's talk about your specific challenges and how my combination of technical skills and product thinking can solve them.",
      "email": "nikolay.trakiyski@gmail.com",
      "phone": "+359893401356",
      "linkedin": "linkedin.com/in/nikolaytrakiyski"
    }
  }
}